
// 1.створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

let a = [1, 2, 3, 4, 5];
let b = ["hello", "world", "developer", "strong", "fullstack"];
let c = ["hello world",28,36.6,true,"octen"];
console.log(a);
console.log(b);
console.log(c);

//2.Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

let d = [];
d[0] = "hello";
d[1] = "world";
console.log(d)

//3. За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

for (let k = 0; k < 10; k++ ){
    document.write(`<div>Hello World</div>`);
}
for (let l = 0; l < 10; l++ ){
    document.write(`<div>Index ${l}</div>`);
}

